const names = [
    "Алтан", "Амина", "Баатар", "Сүхбаатар", "Нямдорж", "Ганболд",
    "Чимэдсүрэн", "Батчимэг", "Мөнхтулга", "Тэмүүжин", "Нямсүрэн",
    "Саруултуяа", "Халиун", "Даваажаргал", "Гантуяа", "Өсөхбаяр",
    "Төгөлдөр", "Энхбаяр", "Эрдэнэжаргал", "Цэцэгмаа", "Тунгалагтуяа",
    "Болормаа", "Жаргалмаа", "Ганбат", "Очирбат", "Цагаанболд",
    "Мөнхжаргал", "Өлзийсайхан", "Хасбаатар", "Зулмаа", "Оргилмаа",
    "Дорлигжав", "Ганзориг", "Чимэг", "Бадамцэцэг", "Алтантуяа",
    "Даваадорж", "Сэржмядаг", "Мөнхсайхан", "Оюунтуяа", "Хонгорзул",
    "Ариунзаяа", "Эрдэнэсайхан", "Зоригтбаатар", "Сайнбилэг",
    "Гэрэлмаа", "Өлзийтогтох", "Өндөржаргал", "Хангарьд", "Амгалан",
    "Буянжаргал", "Золбоо", "Халиунаа", "Чулуунбат", "Чулуунзориг",
    "Саруулгэрэл", "Тулгат", "Билгүүн", "Ганцэцэг", "Эрдэнэчимэг",
    "Удвал", "Мягмарсүрэн", "Дөлгөөн", "Урангоо", "Жавхлантуяа",
    "Ганхуяг", "Болорчимэг", "Шинэцэцэг", "Эрдэнэтуяа", "Ундрал",
    "Номин", "Очиртулга", "Туяацэцэг", "Баттулга", "Энхтуяа",
    "Баянмөнх", "Сэтгэлзаяа", "Мандах", "Гомбодорж", "Уранчимэг",
    "Мөнгөнцэцэг", "Нартуяа", "Өлзий", "Хонгормаа", "Дашням",
    "Цолмон", "Батзориг", "Энхжин", "Хишигжаргал", "Эрдэнэбат",
    "Наргарьд", "Хасэрдэнэ", "Золжаргал", "Энхсаруул", "Сувдмаа",
    "Дашдондог", "Зоригтболд", "Батсайхан", "Ганжаргал", "Сайхантуяа",
    "Эрдэнэбат", "Намуун", "Энхболд", "Өсөхжаргал", "Анхбаяр",
    "Жаргалсайхан", "Нямбаяр", "Тэнгис", "Тэмүүлэн", "Чингис",
    "Мөнхтуяа", "Дорж", "Доржсүрэн", "Хашбаатар", "Амгаланбаатар",
    "Чимэгтуяа", "Тэмүүлжаргал", "Сүхдорж", "Хонгортуяа", "Буянхишиг"
];

const lastName = [
    "Батбаяр", "Алтангэрэл", "Даваажаргал", "Ганболд", "Ганзориг", "Дорж",
    "Ганхуяг", "Мөнхбат", "Тулга", "Цэрэнбат", "Тэмүүжин", "Эрдэнэбат",
    "Хасбаатар", "Сүхбаатар", "Нямбаяр", "Энхбаяр", "Мөнхсайхан", "Нямдорж",
    "Цагаанболд", "Өлзийсайхан", "Гантуяа", "Өсөхбаяр", "Батцэцэг", "Гэрэлт",
    "Төгсжаргал", "Батчулуун", "Хишигжаргал", "Мөнхжаргал", "Зоригтбаатар",
    "Долгорсүрэн", "Ганцэцэг", "Мөнхтулга", "Төгссайхан", "Ганбат", "Чулуун",
    "Даваадорж", "Баярмаа", "Давжуул", "Батжаргал", "Болормаа", "Цэрэнчимэг",
    "Болорцэцэг", "Мөнхсүрэн", "Билгүүн", "Төмөр", "Мягмарсүрэн", "Төмөртуяа",
    "Баттулга", "Дашдорж", "Жаргалсайхан", "Сүхдорж", "Цагаанцэцэг", "Тулгат",
    "Нямсүрэн", "Ганболд", "Чимэдсайхан", "Тэнгис", "Цолмон", "Ганбаатар",
    "Гэрэлтуяа", "Ууганбаяр", "Золбоо", "Саруул", "Отгонтуяа", "Тугал",
    "Түвшинбаяр", "Саруултуяа", "Очирбат", "Сүхбаатар", "Зоригтболд", "Тэмүүлэн",
    "Доржсүрэн", "Дашням", "Жанцанбат", "Лувсанжамц", "Цэдэнбал", "Мөнхтулга",
    "Төмөрчулуун", "Нарантуяа", "Мөнхтөмөр", "Эрдэнэтулга", "Цэрэнбат",
    "Чингис", "Батхаан", "Алтантуяа", "Мягмарбат", "Төгсбат", "Чимэдсүрэн",
    "Цогтбаатар", "Ариунболд", "Нямсүрэн", "Эрдэнэдорж", "Өсөхтулга", "Эрдэнэчимэг",
    "Ганхаан", "Сувдмаа", "Халтуга", "Галбаатар", "Цэгцбат", "Түмэн-Эрдэнэ",
    "Наран", "Эрхэмтулга", "Бадмаанямбуу", "Заяабат", "Цэрэнчимэг", "Шинэхүү",
    "Бадамсүрэн", "Доржсүрэн", "Харлампий", "Гантулга", "Хангай", "Заяабаяр",
    "Эрдэнэжаргал", "Чулуунцэцэг", "Гэрэлмаа", "Намсрай", "Чимэддорж", "Нямдэлгэр",
    "Өлзийбаяр", "Хонгорсүрэн", "Ганболд", "Эрдэнэсайхан", "Жавхлан", "Ганболд",
    "Гандэр", "Түвшин", "Шаравдар", "Торгууд", "Тамир", "Атлант", "Эрхэмбаяр",
    "Цэцэнхүү", "Ганболд", "Гантал", "Заяа", "Чимэд", "Очир", "Сарав",
    "Санжмятав", "Намсрай", "Батсайхан", "Даваадорж", "Тулга", "Сарантуяа"
];

names.sort(() => Math.random() - 0.5);
lastName.sort(() => Math.random() - 0.5);

export { names, lastName };